AccumulationRegisters/ВзаиморасчетыСКонтрагентамиАкционерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиАкционерами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетовСФизическимиЛицами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыплатыПрочихДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ГруппыНачисленияУдержанияВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ГруппыНачисленияУдержанияВыплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начислено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоБухучету</Name>
					<Comment> Возвращает выплаты в течение календарного месяца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоМесяцамРасчета</Name>
					<Comment>Возвращает выплаты за расчетные месяцы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОсобыхНачисленийИУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОсобыхНачисленийИУдержаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАвторскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорРаботыУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДСВРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяВыгодаПоЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоПроцентовПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоначисленныйПоРезультатамПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛЗачтено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛКЗачету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПередачаЗадолженностиВНалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛСПревышения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивидендыСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймаИзЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьПодарковПризов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребениеСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УчетНачисленнойЗарплатыРК/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует пустую временную таблицу ВТРаспределениеНачисленийТекущегоДокумента.
// 
// Параметры:
// 		МенеджерВременныхТаблиц - менеджер временных таблиц.
//  ЗУПК Аналог процедуры УчетНачисленнойЗарплаты.СоздатьПустуюВТРаспределениеНачисленийТекущегоДокумента()
Процедура СоздатьПустуюВТРаспределениеНачисленийНАТекущегоДокумента(МенеджерВременныхТаблиц) Экспорт

	ПустоеЗначениеТерриторияНаЯзыкеЗапросов = УчетНачисленнойЗарплатыВнутренний.ПустоеЗначениеТерриторияНаЯзыкеЗапросов();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат,
	|	&ПустоеЗначениеТерриторияНаЯзыкеЗапросов КАК Территория,
	|	&ПустоеЗначениеТерриторияНаЯзыкеЗапросов КАК МестоПолученияДохода,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка) КАК Начисление,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходовИсполнительногоПроизводства.ПустаяСсылка) КАК ВидДоходаИсполнительногоПроизводства,
	|	0 КАК Сумма
	|ПОМЕСТИТЬ ВТРаспределениеНачисленийНАТекущегоДокумента";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустоеЗначениеТерриторияНаЯзыкеЗапросов", ПустоеЗначениеТерриторияНаЯзыкеЗапросов);
	Запрос.Выполнить();

КонецПроцедуры

// Формирует временную таблицу ВТРаспределениеНачисленийНАТекущегоДокумента.
// Если ведется учет по статьям финансирования, таблица не формируется.
//
// Параметры:
// 	ДанныеДляПроведения - Структура, описание см ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения.
//  ЗУПК Аналог процедуры УчетНачисленнойЗарплаты.СоздатьВТРаспределениеНачисленийТекущегоДокумента()
Процедура СоздатьВТРаспределениеНачисленийНАТекущегоДокумента(ДанныеДляПроведения) Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		Возврат;
	КонецЕсли;
	
	Движения 				= ДанныеДляПроведения.Движения;
	МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	ПериодРегистрации 		= ДанныеДляПроведения.ПериодРегистрации;
	Авансом 				= ДанныеДляПроведения.Авансом;
	
    ИмяТаблицыРегистра = "НачисленияУдержанияПоКонтрагентамАкционерам";
	
	ДвиженияНачисленийУдержаний = Движения[ИмяТаблицыРегистра];
	
	ТаблицаДокумента = ДвиженияНачисленийУдержаний.Выгрузить();
	
	Отбор = Новый Структура("ГруппаНачисленияУдержанияВыплаты,Период", Перечисления.ГруппыНачисленияУдержанияВыплаты.Начислено, ПериодРегистрации);
	Начисления = ТаблицаДокумента.Скопировать(Отбор);
	
	Отбор.ГруппаНачисленияУдержанияВыплаты = Перечисления.ГруппыНачисленияУдержанияВыплаты.Справочно;
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		Если ТипЗнч(СтрокаТЗ.НачислениеУдержание) = Тип("ПланВидовРасчетаСсылка.Начисления") Или СтрокаТЗ.НачислениеУдержание = Перечисления.ВидыОсобыхНачисленийИУдержаний.СтоимостьПодарковПризов Тогда
			ЗаполнитьЗначенияСвойств(Начисления.Добавить(), СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Отбор.ГруппаНачисленияУдержанияВыплаты = Перечисления.ГруппыНачисленияУдержанияВыплаты.Льготы;
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(Начисления.Добавить(), СтрокаТЗ);
	КонецЦикла;
	
	Если ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, "ВТРаспределениеНачисленийНАТекущегоДокумента") Тогда
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТРаспределениеНачисленийНАТекущегоДокумента");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачисленияДокумента", Начисления);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияДокумента.Сотрудник КАК Сотрудник,
	|	НачисленияДокумента.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат,
	|	НачисленияДокумента.ТерриторияВыполненияРаботВОрганизации КАК Территория,
	|	НачисленияДокумента.МестоПолученияДохода КАК МестоПолученияДохода,
	|	НачисленияДокумента.НачислениеУдержание КАК Начисление,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	НачисленияДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленияДокумента.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	НачисленияДокумента.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТРаспределениеНачисленийНАТекущегоДокумента
	|ИЗ
	|	&НачисленияДокумента КАК НачисленияДокумента
    |";
	Запрос.Выполнить();
	
КонецПроцедуры 

// Заполняет документы-основания при проведении ограничения взысканий
//
// Параметры:
// 	
//  
Процедура ЗаполнитьДокументыОснованияОграниченияВзысканий(МесяцНачисления, Организация, Движения) Экспорт

    
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВзаиморасчетыСКонтрагентамиАкционерами", Движения.ВзаиморасчетыСКонтрагентамиАкционерами);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Период КАК Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.НомерСтроки КАК НомерСтроки,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Активность КАК Активность,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения КАК ВидДвижения,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование КАК ДокументОснование,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ГруппаНачисленияУдержанияВыплаты КАК ГруппаНачисленияУдержанияВыплаты,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_ВзаиморасчетыСКонтрагентамиАкционерами
	               |ИЗ
	               |	&ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период КАК Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СпособРасчетов КАК СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяРасходов КАК СтатьяРасходов,
	               |	МАКСИМУМ(ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование) КАК ДокументОснование,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение КАК Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	               |ПОМЕСТИТЬ ВТ_ВзаиморасчетыПоДокументамОснованиям
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			МЕСЯЦ,
	               |			(Организация, ФизическоеЛицо, СпособРасчетов, СтатьяФинансирования, СтатьяРасходов, ВидДоходаИсполнительногоПроизводства, Подразделение, ПериодВзаиморасчетов) В
	               |				(ВЫБРАТЬ
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	               |				ИЗ
	               |					ВТ_ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами)) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяРасходов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ПериодВзаиморасчетов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Период КАК Период,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Активность КАК Активность,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения КАК ВидДвижения,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ГруппаНачисленияУдержанияВыплаты КАК ГруппаНачисленияУдержанияВыплаты,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Сотрудник КАК Сотрудник,
	               |	ВТ_ВзаиморасчетыПоДокументамОснованиям.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами КАК ВТ_ВзаиморасчетыСКонтрагентамиАкционерами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВзаиморасчетыПоДокументамОснованиям КАК ВТ_ВзаиморасчетыПоДокументамОснованиям
	               |		ПО ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Период = ВТ_ВзаиморасчетыПоДокументамОснованиям.Период
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ВТ_ВзаиморасчетыПоДокументамОснованиям.Организация
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_ВзаиморасчетыПоДокументамОснованиям.ФизическоеЛицо
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов = ВТ_ВзаиморасчетыПоДокументамОснованиям.СпособРасчетов
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования = ВТ_ВзаиморасчетыПоДокументамОснованиям.СтатьяФинансирования
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов = ВТ_ВзаиморасчетыПоДокументамОснованиям.СтатьяРасходов
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства = ВТ_ВзаиморасчетыПоДокументамОснованиям.ВидДоходаИсполнительногоПроизводства
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение = ВТ_ВзаиморасчетыПоДокументамОснованиям.Подразделение
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов = ВТ_ВзаиморасчетыПоДокументамОснованиям.ПериодВзаиморасчетов";
	
	Движения.ВзаиморасчетыСКонтрагентамиАкционерами.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
	
#КонецОбласти
